[
    {
        "id": 1,
        "name": "The Witcher 3: Wild Hunt",
        "release_date": "2015-05-18",
        "developer": "CD Projekt Red",
        "genre": "Action RPG",
        "image": "https:\/\/c4.wallpaperflare.com\/wallpaper\/13\/623\/644\/the-witcher-the-witcher-3-wild-hunt-geralt-of-rivia-wallpaper-preview.jpg",
        "platforms": [
            "PC",
            "MAC",
            "XONE",
            "PS4",
            "NS",
            "PS5",
            "XBSX"
        ],
        "description": "The Witcher 3: Wild Hunt is an action role-playing video game developed by Polish developer CD Projekt Red, and first published in 2015. It is the sequel to the 2011 game The Witcher 2: Assassins of Kings and the third game in The Witcher video game series, played in an open world with a third-person perspective. The games are based on The Witcher series of fantasy novels written by Andrzej Sapkowski.",
        "description_short": "The Witcher 3: Wild Hunt is an action role-playing video game developed by Polish developer CD Projekt Red",
        "score": 10,
        "created_at": "2022-05-31 12:46:19",
        "updated_at": "2022-05-31 12:46:19",
        "deleted_at": null
    },
    {
        "id": 2,
        "name": "Vampire: The Masquerade – Bloodlines",
        "release_date": "2004-11-16",
        "developer": "Troika Games",
        "genre": "Action role-playing",
        "image": "https:\/\/upload.wikimedia.org\/wikipedia\/en\/9\/96\/Vampire_-_The_Masquerade_%E2%80%93_Bloodlines_Coverart.png",
        "platforms": [
            "PC",
            "PS4",
            "PS4",
            "PS4"
        ],
        "description": "Vampire: The Masquerade – Bloodlines is a 2004 action role-playing video \r\n            game developed by Troika Games and published by Activision for Microsoft Windows. \r\n            Set in White Wolf Publishing's World of Darkness, the game is based on White \r\n            Wolf's role-playing game Vampire: The Masquerade and follows a human who is killed\r\n             and revived as a fledgling vampire. The game depicts the fledgling's journey through \r\n             the early 21st-century Los Angeles to uncover the truth behind a recently discovered relic \r\n             that heralds the end of all vampires.",
        "description_short": "A  action role-playing video game developed by Troika Games.",
        "score": 8,
        "created_at": "2022-05-31 12:46:21",
        "updated_at": "2022-05-31 12:46:21",
        "deleted_at": null
    },
    {
        "id": 3,
        "name": "Elden Ring",
        "release_date": "2022-02-25",
        "developer": "FromSoftware",
        "genre": "Action role-playing",
        "image": "https://preview.redd.it/bueqtztxmnj81.png?auto=webp&s=692ee8026d707e035977daf27c5ef6298e019718",
        "platforms": [
            "PC",
            "PS4",
            "PS5"
        ],
        "description": "Elden Ring is a 2022 action role-playing game developed by FromSoftware and published by Bandai Namco Entertainment. Directed by Hidetaka Miyazaki with worldbuilding provided by fantasy writer George R. R. Martin, it was released for PlayStation 4, PlayStation 5, Windows, Xbox One, and Xbox Series X/S on February 25",
        "description_short": "Elden Ring is a 2022 action role-playing game developed by FromSoftware and published by Bandai Namco Entertainment.",
        "score": 9,
        "created_at": "2022-05-31 12:46:21",
        "updated_at": "2022-05-31 12:46:21",
        "deleted_at": null
    },
    {
        "id": 4,
        "name": "Dark Souls",
        "release_date": "2011-09-22",
        "developer": "FromSoftware",
        "genre": "Action role-playing",
        "image": "https:\/\/upload.wikimedia.org\/wikipedia\/en\/8\/8d\/Dark_Souls_Cover_Art.jpg?20130618141801",
        "platforms": [
            "PlayStation 3",
            "Xbox 360",
            "Microsoft Windows",
            "PlayStation 4",
            "Xbox One",
            "Nintendo Switch"
        ],
        "description": "Dark Souls is a 2011 action role-playing game developed by FromSoftware and published\r\n             by Namco Bandai Games. A spiritual successor to FromSoftware's Demon's Souls, \r\n             the game is the second installment in the Souls series. Dark Souls takes place in the kingdom of Lordran, where players assume the role of a cursed undead character who begins a pilgrimage to discover the fate of their kind. A port for Microsoft Windows was released in August 2012, which featured additional content not seen in the original PlayStation 3 and Xbox 360 versions. The content was released for consoles in October 2012 under the subtitle Artorias of the Abyss.",
        "description_short": "Dark Souls is a 2011 action role-playing game developed by FromSoftware and published by Namco Bandai Games.",
        "score": 9,
        "created_at": "2022-05-31 12:46:20",
        "updated_at": "2022-05-31 12:46:20",
        "deleted_at": null
    },
    {
        "id": 5,
        "name": "DOOM",
        "release_date": " 2016-05-13",
        "developer": "Id Software",
        "genre": "First-person shooter",
        "image": "https://upload.wikimedia.org/wikipedia/en/2/28/Doom_Cover.jpg",
        "platforms": [
            "PC",
            "XONE",
            "PS4"
        ],
        "description": "Doom is a 2016 first-person shooter game developed by id Software and published by Bethesda Softworks. It is the first major installment in the Doom series since 2004's Doom 3. Players take the role of an unnamed space marine, known as the \"Doom Slayer\", as he battles demonic forces from Hell that have been unleashed by the Union Aerospace Corporation within their energy-mining facility on Mars. ",
        "description_short": "Doom is a 2016 first-person shooter game developed by id Software and published by Bethesda Softworks.",
        "score": 9,
        "created_at": "2022-05-31 12:46:20",
        "updated_at": "2022-05-31 12:46:20",
        "deleted_at": null
    },
    {
        "id": 6,
        "name": "Red Dead Redemption 2",
        "release_date": "2018-10-26",
        "developer": "Rockstar Studios",
        "genre": "Action-adventure",
        "image": "https:\/\/upload.wikimedia.org\/wikipedia\/en\/4\/44\/Red_Dead_Redemption_II.jpg",
        "platforms": [
            "PC",
            "XONE",
            "PS4"
        ],
        "description": "Red Dead Redemption 2 is a 2018 action-adventure game developed and published by Rockstar Games. The game is the third entry in the Red Dead series and a prequel to the 2010 game Red Dead Redemption. The story is set in 1899 and follows the exploits of outlaw Arthur Morgan, a member of the Van der Linde gang, in a fictionalized representation of the Western, Midwestern, and Southern United States. Arthur must deal with the decline of the Wild West whilst attempting to survive against government forces, rival gangs, and other adversaries. The game's epilogue follows fellow gang member John Marston, the protagonist of Red Dead Redemption.",
        "description_short": "Red Dead Redemption 2 is a 2018 action-adventure game developed and published by Rockstar Games.",
        "score": 9,
        "created_at": "2022-05-31 12:46:20",
        "updated_at": "2022-05-31 12:46:20",
        "deleted_at": null
    },
    {
        "id": 7,
        "name": "Need for Speed Heat",
        "release_date": "2019-10-08",
        "developer": "Ghost Games",
        "genre": "Racing",
        "image": "https:\/\/upload.wikimedia.org\/wikipedia\/en\/7\/7f\/Cover_Art_of_Need_for_Speed_Heat.png",
        "platforms": [
            "PC",
            "XONE",
            "PS4"
        ],
        "description": "Need for Speed Heat (stylised as NFS Heat) is a 2019 racing video game developed by Ghost Games and published by Electronic Arts for Microsoft Windows, PlayStation 4 and Xbox One. It is the twenty-fourth instalment in the Need for Speed series and commemorates the series' 25th anniversary. The game received mixed reviews from critics, who mostly found the game to be an improvement over the 2015 Need for Speed reboot and Payback but not enough to be a full return to form for the franchise.",
        "description_short": "Need for Speed Heat is a 2019 racing video game developed by Ghost Games and published by Electronic Arts.",
        "score": 7,
        "created_at": "2022-05-31 12:46:20",
        "updated_at": "2022-05-31 12:46:20",
        "deleted_at": null
    }
]